tests/resources/cassettes/test_cancel_invoice.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - DUMMY
      Connection:
      - keep-alive
      Content-Type:
      - application/json
      User-Agent:
      - facturapi-python/0.0.2
    method: GET
    uri: https://www.facturapi.io/v2/invoices/63fe4be4e87ce2001b19077f
  response:
    body:
      string: '{"id":"63fe4be4e87ce2001b19077f","created_at":"2023-02-28T18:45:56.764Z","livemode":false,"cfdi_version":4,"organization":"63fe3f1fe87ce2001b182417","date":"2023-02-28T18:45:56.746Z","customer":{"id":"63fe4be4e87ce2001b190785","legal_name":"REMEDIOS
        VARO","tax_system":"625","tax_id":"VAUR631216M55","address":{"country":"MEX","zip":"06700"}},"address":{"country":"MEX","street":"","exterior":"","interior":"","neighborhood":"","city":"","municipality":"","state":"","zip":"06010"},"verification_url":"https://verificacfdi.facturaelectronica.sat.gob.mx/default.aspx?id=9e7de2b2-ed10-4d9b-9861-95a9b884678f&re=XIA190128J61&rr=VAUR631216M55&tt=84.000000&fe=kF8Lig==","status":"valid","type":"I","cancellation_status":"none","total":84,"uuid":"9e7de2b2-ed10-4d9b-9861-95a9b884678f","use":"G03","folio_number":3,"payment_form":"04","payment_method":"PUE","currency":"MXN","exchange":1,"stamp":{"signature":"O948J1bbJ/gmXXaVt0USxdEfXE6GZC2gpoLggLEznNYwpsDE/Dpy+5NTaByZQISCENFgyboCs7DSYEjqIexCu5YKRgxHFmUd5nqkNcO6EgG9La9XHf0KEowSO1VCMDYU/kmi1njtmxI/j22kKj8aiLMN7hTVY4ys9ts3MoHrFAbTJxqImXXBUKO99YFJumDMECQlKLZZALw9Ize9ZjOVj86doL96l8iwydAmILYdk2jI/SKgDoyqC03ZJY55Ie2ZTiq2+RU2XqSNXe6KlaE4gmnwDFCIAY3vynonztZQNmflSORNL/llfHTtD3ejp5grbYrM7Kv0Nj3Fj5hfkF8Lig==","date":"2023-02-28T12:45:56","sat_cert_number":"20001000000300022323","sat_signature":"2N78YXRazh8w3CILyUVpMgZ4OqQ=","complement_string":"||1.1|9e7de2b2-ed10-4d9b-9861-95a9b884678f|2023-02-28T12:45:56|O948J1bbJ/gmXXaVt0USxdEfXE6GZC2gpoLggLEznNYwpsDE/Dpy+5NTaByZQISCENFgyboCs7DSYEjqIexCu5YKRgxHFmUd5nqkNcO6EgG9La9XHf0KEowSO1VCMDYU/kmi1njtmxI/j22kKj8aiLMN7hTVY4ys9ts3MoHrFAbTJxqImXXBUKO99YFJumDMECQlKLZZALw9Ize9ZjOVj86doL96l8iwydAmILYdk2jI/SKgDoyqC03ZJY55Ie2ZTiq2+RU2XqSNXe6KlaE4gmnwDFCIAY3vynonztZQNmflSORNL/llfHTtD3ejp5grbYrM7Kv0Nj3Fj5hfkF8Lig==|20001000000300022323||"},"items":[{"quantity":2,"discount":0.1,"product":{"description":"Producto
        Test","product_key":"50202201","unit_key":"H87","unit_name":"Pieza","price":42.05,"tax_included":true,"taxes":[{"rate":0.16,"type":"IVA","withholding":false,"factor":"Tasa","ieps_mode":"sum_before_taxes"}],"taxability":"02"},"parts":[{"quantity":1,"description":"Parte
        1","product_key":"50202201"}]}],"export":"01"}'
    headers:
      Content-Length:
      - '2208'
      Date:
      - Tue, 28 Feb 2023 18:46:12 GMT
      Server:
      - Google Frontend
      access-control-allow-origin:
      - '*'
      content-security-policy:
      - 'default-src ''self'';font-src https:;img-src data: https:;script-src ''unsafe-inline''
        https:;style-src https: ''unsafe-inline'';object-src ''none'';connect-src
        https:;frame-src self *.stripe.com *.facebook.com;upgrade-insecure-requests'
      content-type:
      - application/json; charset=utf-8
      etag:
      - W/"8a0-ZZ1SBxkNOBX60OT2R95QSCcdY60"
      expect-ct:
      - max-age=0
      referrer-policy:
      - no-referrer
      strict-transport-security:
      - max-age=15552000; includeSubDomains
      x-cloud-trace-context:
      - e4cea5063d3e69f5ca96372152b07eab/3473647337278966205;o=1
      x-content-type-options:
      - nosniff
      x-dns-prefetch-control:
      - 'off'
      x-download-options:
      - noopen
      x-frame-options:
      - SAMEORIGIN
      x-permitted-cross-domain-policies:
      - none
      x-xss-protection:
      - '0'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - DUMMY
      Connection:
      - keep-alive
      Content-Length:
      - '0'
      Content-Type:
      - application/json
      User-Agent:
      - facturapi-python/0.0.2
    method: DELETE
    uri: https://www.facturapi.io/v2/invoices/63fe4be4e87ce2001b19077f?motive=01
  response:
    body:
      string: '{"id":"63fe4be4e87ce2001b19077f","created_at":"2023-02-28T18:45:56.764Z","livemode":false,"cfdi_version":4,"organization":"63fe3f1fe87ce2001b182417","date":"2023-02-28T18:45:56.746Z","customer":{"id":"63fe4be4e87ce2001b190785","legal_name":"REMEDIOS
        VARO","tax_system":"625","tax_id":"VAUR631216M55","address":{"country":"MEX","zip":"06700"}},"address":{"country":"MEX","street":"","exterior":"","interior":"","neighborhood":"","city":"","municipality":"","state":"","zip":"06010"},"verification_url":"https://verificacfdi.facturaelectronica.sat.gob.mx/default.aspx?id=9e7de2b2-ed10-4d9b-9861-95a9b884678f&re=XIA190128J61&rr=VAUR631216M55&tt=84.000000&fe=kF8Lig==","status":"canceled","type":"I","cancellation_status":"accepted","total":84,"uuid":"9e7de2b2-ed10-4d9b-9861-95a9b884678f","use":"G03","folio_number":3,"payment_form":"04","payment_method":"PUE","currency":"MXN","exchange":1,"stamp":{"signature":"O948J1bbJ/gmXXaVt0USxdEfXE6GZC2gpoLggLEznNYwpsDE/Dpy+5NTaByZQISCENFgyboCs7DSYEjqIexCu5YKRgxHFmUd5nqkNcO6EgG9La9XHf0KEowSO1VCMDYU/kmi1njtmxI/j22kKj8aiLMN7hTVY4ys9ts3MoHrFAbTJxqImXXBUKO99YFJumDMECQlKLZZALw9Ize9ZjOVj86doL96l8iwydAmILYdk2jI/SKgDoyqC03ZJY55Ie2ZTiq2+RU2XqSNXe6KlaE4gmnwDFCIAY3vynonztZQNmflSORNL/llfHTtD3ejp5grbYrM7Kv0Nj3Fj5hfkF8Lig==","date":"2023-02-28T12:45:56","sat_cert_number":"20001000000300022323","sat_signature":"2N78YXRazh8w3CILyUVpMgZ4OqQ=","complement_string":"||1.1|9e7de2b2-ed10-4d9b-9861-95a9b884678f|2023-02-28T12:45:56|O948J1bbJ/gmXXaVt0USxdEfXE6GZC2gpoLggLEznNYwpsDE/Dpy+5NTaByZQISCENFgyboCs7DSYEjqIexCu5YKRgxHFmUd5nqkNcO6EgG9La9XHf0KEowSO1VCMDYU/kmi1njtmxI/j22kKj8aiLMN7hTVY4ys9ts3MoHrFAbTJxqImXXBUKO99YFJumDMECQlKLZZALw9Ize9ZjOVj86doL96l8iwydAmILYdk2jI/SKgDoyqC03ZJY55Ie2ZTiq2+RU2XqSNXe6KlaE4gmnwDFCIAY3vynonztZQNmflSORNL/llfHTtD3ejp5grbYrM7Kv0Nj3Fj5hfkF8Lig==|20001000000300022323||"},"items":[{"quantity":2,"discount":0.1,"product":{"description":"Producto
        Test","product_key":"50202201","unit_key":"H87","unit_name":"Pieza","price":42.05,"tax_included":true,"taxes":[{"rate":0.16,"type":"IVA","withholding":false,"factor":"Tasa","ieps_mode":"sum_before_taxes"}],"taxability":"02"},"parts":[{"quantity":1,"description":"Parte
        1","product_key":"50202201"}]}],"export":"01"}'
    headers:
      Content-Length:
      - '2215'
      Date:
      - Tue, 28 Feb 2023 18:46:13 GMT
      Server:
      - Google Frontend
      access-control-allow-origin:
      - '*'
      content-security-policy:
      - 'default-src ''self'';font-src https:;img-src data: https:;script-src ''unsafe-inline''
        https:;style-src https: ''unsafe-inline'';object-src ''none'';connect-src
        https:;frame-src self *.stripe.com *.facebook.com;upgrade-insecure-requests'
      content-type:
      - application/json; charset=utf-8
      etag:
      - W/"8a7-r3N0vkq3CLbGZhTiNF3FhPegrF0"
      expect-ct:
      - max-age=0
      referrer-policy:
      - no-referrer
      strict-transport-security:
      - max-age=15552000; includeSubDomains
      x-cloud-trace-context:
      - aa8379cbc474f69f9fa9089183795746/16034500098806248652;o=1
      x-content-type-options:
      - nosniff
      x-dns-prefetch-control:
      - 'off'
      x-download-options:
      - noopen
      x-frame-options:
      - SAMEORIGIN
      x-permitted-cross-domain-policies:
      - none
      x-xss-protection:
      - '0'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - DUMMY
      Connection:
      - keep-alive
      Content-Type:
      - application/json
      User-Agent:
      - facturapi-python/0.0.2
    method: GET
    uri: https://www.facturapi.io/v2/invoices/63fe4be4e87ce2001b19077f
  response:
    body:
      string: '{"id":"63fe4be4e87ce2001b19077f","created_at":"2023-02-28T18:45:56.764Z","livemode":false,"cfdi_version":4,"organization":"63fe3f1fe87ce2001b182417","date":"2023-02-28T18:45:56.746Z","customer":{"id":"63fe4be4e87ce2001b190785","legal_name":"REMEDIOS
        VARO","tax_system":"625","tax_id":"VAUR631216M55","address":{"country":"MEX","zip":"06700"}},"address":{"country":"MEX","street":"","exterior":"","interior":"","neighborhood":"","city":"","municipality":"","state":"","zip":"06010"},"verification_url":"https://verificacfdi.facturaelectronica.sat.gob.mx/default.aspx?id=9e7de2b2-ed10-4d9b-9861-95a9b884678f&re=XIA190128J61&rr=VAUR631216M55&tt=84.000000&fe=kF8Lig==","status":"canceled","type":"I","cancellation_status":"accepted","total":84,"uuid":"9e7de2b2-ed10-4d9b-9861-95a9b884678f","use":"G03","folio_number":3,"payment_form":"04","payment_method":"PUE","currency":"MXN","exchange":1,"stamp":{"signature":"O948J1bbJ/gmXXaVt0USxdEfXE6GZC2gpoLggLEznNYwpsDE/Dpy+5NTaByZQISCENFgyboCs7DSYEjqIexCu5YKRgxHFmUd5nqkNcO6EgG9La9XHf0KEowSO1VCMDYU/kmi1njtmxI/j22kKj8aiLMN7hTVY4ys9ts3MoHrFAbTJxqImXXBUKO99YFJumDMECQlKLZZALw9Ize9ZjOVj86doL96l8iwydAmILYdk2jI/SKgDoyqC03ZJY55Ie2ZTiq2+RU2XqSNXe6KlaE4gmnwDFCIAY3vynonztZQNmflSORNL/llfHTtD3ejp5grbYrM7Kv0Nj3Fj5hfkF8Lig==","date":"2023-02-28T12:45:56","sat_cert_number":"20001000000300022323","sat_signature":"2N78YXRazh8w3CILyUVpMgZ4OqQ=","complement_string":"||1.1|9e7de2b2-ed10-4d9b-9861-95a9b884678f|2023-02-28T12:45:56|O948J1bbJ/gmXXaVt0USxdEfXE6GZC2gpoLggLEznNYwpsDE/Dpy+5NTaByZQISCENFgyboCs7DSYEjqIexCu5YKRgxHFmUd5nqkNcO6EgG9La9XHf0KEowSO1VCMDYU/kmi1njtmxI/j22kKj8aiLMN7hTVY4ys9ts3MoHrFAbTJxqImXXBUKO99YFJumDMECQlKLZZALw9Ize9ZjOVj86doL96l8iwydAmILYdk2jI/SKgDoyqC03ZJY55Ie2ZTiq2+RU2XqSNXe6KlaE4gmnwDFCIAY3vynonztZQNmflSORNL/llfHTtD3ejp5grbYrM7Kv0Nj3Fj5hfkF8Lig==|20001000000300022323||"},"items":[{"quantity":2,"discount":0.1,"product":{"description":"Producto
        Test","product_key":"50202201","unit_key":"H87","unit_name":"Pieza","price":42.05,"tax_included":true,"taxes":[{"rate":0.16,"type":"IVA","withholding":false,"factor":"Tasa","ieps_mode":"sum_before_taxes"}],"taxability":"02"},"parts":[{"quantity":1,"description":"Parte
        1","product_key":"50202201"}]}],"export":"01"}'
    headers:
      Content-Length:
      - '2215'
      Date:
      - Tue, 28 Feb 2023 18:46:13 GMT
      Server:
      - Google Frontend
      access-control-allow-origin:
      - '*'
      content-security-policy:
      - 'default-src ''self'';font-src https:;img-src data: https:;script-src ''unsafe-inline''
        https:;style-src https: ''unsafe-inline'';object-src ''none'';connect-src
        https:;frame-src self *.stripe.com *.facebook.com;upgrade-insecure-requests'
      content-type:
      - application/json; charset=utf-8
      etag:
      - W/"8a7-r3N0vkq3CLbGZhTiNF3FhPegrF0"
      expect-ct:
      - max-age=0
      referrer-policy:
      - no-referrer
      strict-transport-security:
      - max-age=15552000; includeSubDomains
      x-cloud-trace-context:
      - edda572d6af8778b1402fa42d8bbbb03/5702756781923230727;o=1
      x-content-type-options:
      - nosniff
      x-dns-prefetch-control:
      - 'off'
      x-download-options:
      - noopen
      x-frame-options:
      - SAMEORIGIN
      x-permitted-cross-domain-policies:
      - none
      x-xss-protection:
      - '0'
    status:
      code: 200
      message: OK
version: 1
